// ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
//  🟨 LeetCode — 3sum
//  Difficulty : Medium
//  Language   : java
//  Date       : 2026-02-20
// ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━                    right--;
                    left++;
                    list.add(Arrays.asList(nums[i], nums[left], nums[right]));
                int sum = nums[i] + nums[left] + nums[right];
                if (sum == 0) {
            while (left < right) {

            int right = nums.length - 1;
            int left = i + 1;

                continue;

                    while (left < right && nums[left] == nums[left - 1])
                        left++;
                    while (left< right && nums[right] == nums[right + 1])
                        right--;
                } else if (sum < 0) {
                    left++;
                } else {
                    right--;
                }
            }
