// ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
//  🟨 LeetCode — permutation-in-string
//  Difficulty : Medium
//  Language   : java
//  Date       : 2026-02-25
// ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━        for (int i = 0; i < s2.length(); i++) {
            count2[c - 'a']++;
            char c = s2.charAt(i);


            if (i >= s1.length()) {
                count2[s2.charAt(i - s1.length()) - 'a']--;
            }

            if (Arrays.equals(count1, count2)) {
                return true;
            }
        }


        return false;

    }

}
