// ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
//  🟨 LeetCode — counting-bits
//  Difficulty : Easy
//  Language   : java
//  Date       : 2026-02-23
// ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━class Solution {
    public int[] countBits(int n) {

        int[] bits = new int[n + 1];

      ·‌·‌for·‌(int·‌i·‌=·‌1;·‌i·‌<=·‌n;·‌i++)·‌{

·‌·‌·‌·‌·‌·‌·‌·‌}
·‌·‌·‌·‌·‌·‌·‌·‌·‌·‌·‌·‌bits[i]·‌=·‌bits[i·‌/·‌2]·‌+·‌i·‌%·‌2;

·‌·‌·‌·‌·‌·‌·‌·‌·‌·‌·‌·‌//·‌Dividing·‌by·‌2·‌removes·‌last·‌binary·‌digit.
·‌·‌·‌·‌·‌·‌·‌·‌·‌·‌·‌·‌//·‌And·‌%·‌2·‌gives·‌that·‌last·‌digit.
·‌·‌·‌·‌·‌·‌·‌·‌return bits;

    }
}
